# Insert Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
SlabShapeCreaseArray..::..Insert Method
SlabShapeCreaseArray Class See Also
---
Insert the specified item into the array.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual void Insert(
	SlabShapeCrease item,
	int index
)
```

Visual Basic
---
```text
Public Overridable Sub Insert ( _
	item As SlabShapeCrease, _
	index As Integer _
)
```

Visual C++
---
```text
public:
virtual void Insert(
	SlabShapeCrease^ item,
	int index
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB..::..SlabShapeCreaseThe item to be inserted into the array.
index
    Type: System..::..Int32The item will be inserted before this index.
# ### Return Value
Returns whether the item was inserted into the array.
# See Also
SlabShapeCreaseArray Class
Autodesk.Revit.DB Namespace